# Analyzing Starbucks App Data

This case was created for the AAEI Data Analytics Module.

‚ñ∂Ô∏è First, run the code cell below to import `unittest`, a module used for **üß≠ Check Your Work** sections.

In [1]:
# DO NOT MODIFY THE CODE IN THIS CELL
import unittest
tc = unittest.TestCase()

---

### üéØ Part 1: Import Pandas and NumPy

#### üëá Tasks

- ‚úîÔ∏è Import the following Python packages.
    1. `pandas`: Use alias `pd`.
    2. `numpy`: Use alias `np`.

In [2]:
### BEGIN SOLUTION
import pandas as pd
import numpy as np
### END SOLUTION

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [3]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-01'
_points = 2

tc.assertTrue("pd" in globals(), "Check whether you have correctly import Pandas with an alias.")
tc.assertTrue("np" in globals(), "Check whether you have correctly import NumPy with an alias.")

---

### üìå Load data

Throughout this problem set, you'll work with the Starbucks Customer Rewards Program dataset. ‚òï The dataset was originally released as a part of a capstone project of a Udacity course.

For the purpose of this course, the original dataset in JSON format has been transformed to CSV files for convenience. You can download the original JSON files [here](https://www.kaggle.com/blacktile/starbucks-app-customer-reward-program-data?select=portfolio.json).

‚ñ∂Ô∏è Run the code cell below to read the transcripts data into `df_transcript`.

In [4]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_transcript = pd.read_csv('https://raw.githubusercontent.com/subwaymatch/aaei-notebooks/main/transcript.csv.gz')

# Used for intermediate checks
df_transcript_backup = df_transcript.copy()

# Print 10 last rows
df_transcript.tail(10)

,member_id,event,time,offer_id,amount
306524,d613ca9c59dd42f497bdbf6178da54a7,transaction,714,NaN,25.14
306525,eec70ab28af74a22a4aeb889c0317944,transaction,714,NaN,43.58
306526,24f56b5e1849462093931b164eb803b5,transaction,714,NaN,22.64
306527,24f56b5e1849462093931b164eb803b5,offer completed,714,fafdcd668e3743c1bb461111dcafc2a4,NaN
306528,5ca2620962114246ab218fc648eb3934,transaction,714,NaN,2.20
306529,b3a1272bc9904337b331bf348c3e8c17,transaction,714,NaN,1.59
306530,68213b08d99a4ae1b0dcb72aebd9aa35,transaction,714,NaN,9.53
306531,a00058cf10334a308c68e7631c529907,transaction,714,NaN,3.61
306532,76ddbd6576844afe811f1a3c0fbb5bec,transaction,714,NaN,3.53
306533,c02b10e8752c4d8e9b73f918558531f7,transaction,714,NaN,4.05

The table below describes the columns in `df_transcript`.

| Field | Description |
|---|---|
| member_id | Member ID |
| event | Type of event ('offer received',   'offer completed', 'transaction') |
| time | Time as continuous value |
| offer_id | Offer ID |
| amount | Amount of purchase or NaN if   non-purchase |

---

### üéØ Part 2: Find the number of rows and columns

#### üëá Tasks

- ‚úîÔ∏è Store the number of rows in `df_transcript` to a new variable named `num_rows`.
- ‚úîÔ∏è Store the number of columns in `df_transcript` to a new variable named `num_cols`.
- ‚úîÔ∏è Use `.shape`, not `len()`.

In [5]:
### BEGIN SOLUTION
num_rows = df_transcript.shape[0]
num_cols = df_transcript.shape[1]
### END SOLUTION

print(f"Number of rows: {num_rows}")
print(f"Number of columns: {num_cols}")

Number of rows: 306534
Number of columns: 5

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [6]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-02'
_points = 2

tc.assertEqual(num_rows, len(df_transcript_backup.index), f"Number of rows should be {len(df_transcript_backup.index)}")
tc.assertEqual(num_cols, len(df_transcript_backup.columns), f"Number of columns should be {len(df_transcript_backup.columns)}")

---

### üéØ Part 3: Find all customer purchases

‚ñ∂Ô∏è First, run the code cell below to print out all event types recorded in `df_transcript`.

In [7]:
# NO NEED TO CHANGE THE CODE BELOW
list(df_transcript["event"].unique())

['offer received', 'offer viewed', 'transaction', 'offer completed']

There are four event types. We'll first only look at customer purchases (transactions).

#### üëá Tasks

- ‚úîÔ∏è Using `df_transcript`, find rows where the `event` is `"transaction"`.
    - We're excluding any events related to loyalty offers for now.
- ‚úîÔ∏è Store the filtered rows to `df_transactions`.
- ‚úîÔ∏è `df_transcript` should remain unaltered.

#### üîë Expected Output of `df_transactions.head(3)`

|       |                        member_id |       event | time | offer_id | amount |
|------:|---------------------------------:|------------:|-----:|---------:|-------:|
| 12654 | 02c083884c7d45b39cc68e1314fec56c | transaction |    0 |      NaN |   0.83 |
| 12657 | 9fa9ae8f57894cc9a3b8a9bbe0fc1b2f | transaction |    0 |      NaN |  34.56 |
| 12659 | 54890f68699049c2a04d415abc25e717 | transaction |    0 |      NaN |  13.23 |

In [8]:
### BEGIN SOLUTION
df_transactions = df_transcript[df_transcript["event"] == "transaction"]
### END SOLUTION

df_transactions.head(3)

                              member_id        event  time offer_id  amount
12654  02c083884c7d45b39cc68e1314fec56c  transaction     0      NaN    0.83
12657  9fa9ae8f57894cc9a3b8a9bbe0fc1b2f  transaction     0      NaN   34.56
12659  54890f68699049c2a04d415abc25e717  transaction     0      NaN   13.23

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [9]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-03'
_points = 2

# df_you should remain unaltered
pd.testing.assert_frame_equal(df_transcript, df_transcript_backup, "The original DataFrame should remain unaltered")

# Check result
pd.testing.assert_frame_equal(df_transactions.sort_values(df_transactions.columns.to_list()).reset_index(drop=True),
                              df_transcript_backup.query('event == "transaction"')
                                 .sort_values(df_transcript_backup.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 4: Drop unused columns

‚ñ∂Ô∏è Before proceeding, run the code cell below.

In [10]:
# DO NOT CHANGE THE CODE BELOW
df_transactions = df_transactions.copy()

#### üëá Tasks

- ‚úîÔ∏è Drop `event`, `time`, and `offer_id` columns from `df_transactions` **in-place**.
- ‚úîÔ∏è You should directly drop the columns from `df_transactions` using the `inplace=True` option.

#### üöÄ Hints

Use the following code as a reference.

```python
my_dataframe.drop(columns=["my_column1", "my_column2"], inplace=True)
```

#### üîë Expected Output

|       |                        member_id | amount |
|------:|---------------------------------:|-------:|
| 12654 | 02c083884c7d45b39cc68e1314fec56c |   0.83 |
| 12657 | 9fa9ae8f57894cc9a3b8a9bbe0fc1b2f |  34.56 |
| 12659 | 54890f68699049c2a04d415abc25e717 |  13.23 |

In [11]:
### BEGIN SOLUTION
df_transactions.drop(columns=["event", "time", "offer_id"], inplace=True)
### END SOLUTION

df_transactions.head(3)

                              member_id  amount
12654  02c083884c7d45b39cc68e1314fec56c    0.83
12657  9fa9ae8f57894cc9a3b8a9bbe0fc1b2f   34.56
12659  54890f68699049c2a04d415abc25e717   13.23

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [12]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-04'
_points = 2

df_check = df_transcript_backup.query('event == "transaction"')[['member_id', 'amount']]

# Check result
pd.testing.assert_frame_equal(df_transactions.sort_values(df_transactions.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 5: Mean, max, and median transaction amount

#### üëá Tasks

- ‚úîÔ∏è Find the mean (average), max, and median of all purchase amounts.
    - Use the `amount` column in `df_transactions`.
- ‚úîÔ∏è Store the calculated results to the following three new variables:
    - `amount_mean`: Average transaction amount
    - `amount_median`: Median transaction amount
    - `amount_max`: Maximum transaction amount

#### üöÄ Hints

```python
my_series.mean()   # Returns the mean of a Series
my_series.median() # Returns the median of a Series
my_series.max()    # Returns the max of a Series
```

#### üîë Expected Output

`mean=12.78, median=8.89, max=1062.28`

In [13]:
### BEGIN SOLUTION
amount_mean = df_transactions['amount'].mean()
amount_median = df_transactions['amount'].median()
amount_max = df_transactions['amount'].max()
### END SOLUTION

print(f'mean={amount_mean:.2f}, median={amount_median:.2f}, max={amount_max:.2f}')

mean=12.78, median=8.89, max=1062.28

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [14]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-05'
_points = 2

tc.assertAlmostEqual(amount_mean, 12.777356156398204)
tc.assertAlmostEqual(amount_median, 8.89)
tc.assertAlmostEqual(amount_max, 1062.28)

---

### üìå Load customer profiles

We want to go further with the purchase data analysis by looking at the customers. Unfortunately, the information we currently have about the customers in each purchase is limited. We only have their unique IDs (e.g., `02c083884c7d45b39cc68e1314fec56c`, `9fa9ae8f57894cc9a3b8a9bbe0fc1b2f`).

In the next few steps, you'll read the customer profiles data and link them to `df_transactions` using `member_id`.

‚ñ∂Ô∏è Run the code cell below to read the customer profiles data into `df_profiles`.

In [15]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_profiles = pd.read_csv('https://raw.githubusercontent.com/subwaymatch/aaei-notebooks/main/profile.csv')

# Used for intermediate checks
df_profiles_backup = df_profiles.copy()

# Print first 10 rows
df_profiles.head(10)

                          member_id gender   age became_member_on    income
0  68be06ca386d4c31939f3a4f0e3dd783    NaN   NaN       2017-02-12       NaN
1  0610b486422d4921ae7d2bf64640c50b      F  55.0       2017-07-15  112000.0
2  38fe809add3b4fcf9315a9694bb96ff5    NaN   NaN       2018-07-12       NaN
3  78afa995795e4d85b5d9ceeca43f5fef      F  75.0       2017-05-09  100000.0
4  a03223e636434f42ac4c3df47e8bac43    NaN   NaN       2017-08-04       NaN
5  e2127556f4f64592b11af22de27a7932      M  68.0       2018-04-26   70000.0
6  8ec6ce2a7e7949b1bf142def7d0e0586    NaN   NaN       2017-09-25       NaN
7  68617ca6246f4fbc85e91a2a49552598    NaN   NaN       2017-10-02       NaN
8  389bc3fa690240e798340f5a15918d5c      M  65.0       2018-02-09   53000.0
9  8974fc5686fe429db53ddde067b88302    NaN   NaN       2016-11-22       NaN

The table below describes the columns in `df_profiles`.

| Field | Description |
|---|---|
| member_id | Unique identifier for each Starbucks app member |
| gender | Gender (NaN if unknown) |
| age | Age (NaN if unknown) |
| became_member_on | Sign-up date |
| income | Annual income (NaN if unknown) |

---

### üéØ Part 6: Find the number of rows with missing gender value

#### üëá Tasks

- ‚úîÔ∏è Find the number of rows where the value in the `gender` column is missing (`NaN`).
- ‚úîÔ∏è Store the count to a new variable named `num_missing`.

#### üöÄ Hints

1. `df["my_column"].isna()` returns a Series of boolean values where rows with missing values return `True`.
2. `my_boolean_series.sum()` returns the number of `True` values in a boolean Series.

#### üîë Expected Output

`There are 2175 rows where the gender value is missing.`

In [16]:
### BEGIN SOLUTION
num_missing = df_profiles["gender"].isna().sum()
### END SOLUTION

print(f'There are {num_missing} rows where the gender value is missing.')

There are 2175 rows where the gender value is missing.

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [17]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-06'
_points = 2

tc.assertEqual(num_missing, 2175)

---

### üéØ Part 7: Remove rows with missing values

#### üëá Tasks

- ‚úîÔ∏è Update `df_profiles` so that it only contains rows where `gender` is NOT missing.

#### üöÄ Hints

```python
df = df[df['some_column'].notna()]
```

#### üîë Expected Output

|  | member_id | gender | age | became_member_on | income |
|---:|---:|---:|---:|---:|---:|
| 1 | 0610b486422d4921ae7d2bf64640c50b | F | 55.0 | 2017-07-15 | 112000.0 |
| 3 | 78afa995795e4d85b5d9ceeca43f5fef | F | 75.0 | 2017-05-09 | 100000.0 |
| 5 | e2127556f4f64592b11af22de27a7932 | M | 68.0 | 2018-04-26 | 70000.0 |
| 8 | 389bc3fa690240e798340f5a15918d5c | M | 65.0 | 2018-02-09 | 53000.0 |
| 12 | 2eeac8d8feae4a8cad5a6af0499a211d | M | 58.0 | 2017-11-11 | 51000.0 |

In [18]:
### BEGIN SOLUTION
df_profiles = df_profiles[df_profiles['gender'].notna()]
### END SOLUTION

df_profiles.head(5)

                           member_id gender   age became_member_on    income
1   0610b486422d4921ae7d2bf64640c50b      F  55.0       2017-07-15  112000.0
3   78afa995795e4d85b5d9ceeca43f5fef      F  75.0       2017-05-09  100000.0
5   e2127556f4f64592b11af22de27a7932      M  68.0       2018-04-26   70000.0
8   389bc3fa690240e798340f5a15918d5c      M  65.0       2018-02-09   53000.0
12  2eeac8d8feae4a8cad5a6af0499a211d      M  58.0       2017-11-11   51000.0

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [19]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-07'
_points = 2

df_check = df_profiles_backup.query('gender == gender')

# Check result
pd.testing.assert_frame_equal(df_profiles.sort_values(df_profiles.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 8: Merge profiles into transactions

‚ñ∂Ô∏è Run the code below to:
1. Convert `age` and `income` columns in `df_profiles` to integer types (from float types).
2. Print out the first three rows of `df_transactions` and `df_profiles`.

In [20]:
# Convert age and income to int64 types
df_profiles['age'] = df_profiles['age'].astype(np.int64)
df_profiles['income'] = df_profiles['income'].astype(np.int64)

display(df_transactions.head(3))
display(df_profiles.head(3))

                              member_id  amount
12654  02c083884c7d45b39cc68e1314fec56c    0.83
12657  9fa9ae8f57894cc9a3b8a9bbe0fc1b2f   34.56
12659  54890f68699049c2a04d415abc25e717   13.23

                          member_id gender  age became_member_on  income
1  0610b486422d4921ae7d2bf64640c50b      F   55       2017-07-15  112000
3  78afa995795e4d85b5d9ceeca43f5fef      F   75       2017-05-09  100000
5  e2127556f4f64592b11af22de27a7932      M   68       2018-04-26   70000

#### üëá Tasks

- ‚úîÔ∏è Merge `df_transactions` and `df_profiles` using an **inner** join type.
    - By using an inner join, we are intentionally removing transactions made by customers with missing gender information.
    - Don't worry about the different types of joins yet. Google "pandas types of joins" if you'd like to find out more.
- ‚úîÔ∏è Place `df_transactions` on the "left" side.
- ‚úîÔ∏è Store the merged DataFrame to `df_merged`.

#### üöÄ Hints

```python
my_merged_dataframe = pd.merge(
    left=left_dataframe,
    right=right_dataframe,
    on='shared_key_column',
    how='inner'
)
```

#### üîë Expected Output

|  | member_id | amount | gender | age | became_member_on | income |
|---:|---:|---:|---:|---:|---:|---:|
| 0 | 02c083884c7d45b39cc68e1314fec56c | 0.83 | F | 20 | 2016-07-11 | 30000 |
| 1 | 02c083884c7d45b39cc68e1314fec56c | 1.44 | F | 20 | 2016-07-11 | 30000 |
| 2 | 02c083884c7d45b39cc68e1314fec56c | 4.56 | F | 20 | 2016-07-11 | 30000 |
| 3 | 02c083884c7d45b39cc68e1314fec56c | 1.53 | F | 20 | 2016-07-11 | 30000 |
| 4 | 02c083884c7d45b39cc68e1314fec56c | 0.50 | F | 20 | 2016-07-11 | 30000 |

In [21]:
### BEGIN SOLUTION
df_merged = pd.merge(
    left=df_transactions,
    right=df_profiles,
    on='member_id',
    how='inner'
)
### END SOLUTION

df_merged.head(5)

,member_id,amount,gender,age,became_member_on,income
0,02c083884c7d45b39cc68e1314fec56c,0.83,F,20,2016-07-11,30000
1,02c083884c7d45b39cc68e1314fec56c,1.44,F,20,2016-07-11,30000
2,02c083884c7d45b39cc68e1314fec56c,4.56,F,20,2016-07-11,30000
3,02c083884c7d45b39cc68e1314fec56c,1.53,F,20,2016-07-11,30000
4,02c083884c7d45b39cc68e1314fec56c,0.50,F,20,2016-07-11,30000

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [22]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-08'
_points = 2

df_check = df_transcript_backup.query('event == "transaction"').merge(
    df_profiles_backup.query('gender == gender'),
    on='member_id',
    how='inner'
).drop(columns=['event', 'time', 'offer_id'])
df_check['age'] = df_check['age'].astype(np.int64)
df_check['income'] = df_check['income'].astype(np.int64)
df_merged_backup = df_check.copy()

# Check result
pd.testing.assert_frame_equal(df_merged.sort_values(df_merged.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 9: Average transaction amount by gender

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged`, find the average transaction amount by gender.
- ‚úîÔ∏è Store the summary DataFrame to `df_mean_by_gender`.
- ‚úîÔ∏è `df_mean_by_gender` should have two non-index columns.
    - `df_mean_by_gender.columns.to_list()` should print out `['gender', 'amount']`.
- ‚úîÔ∏è `df_merged` should remain unaltered.

#### üöÄ Hints

```python
my_result = df.groupby('some_column', as_index=False).agg({
      'another_column': np.mean
})
```

#### üîë Expected Output

|  | gender | amount |
|---:|---:|---|
| 0 | F | 17.490077 |
| 1 | M | 11.606600 |
| 2 | O | 14.798731 |

In [23]:
### BEGIN SOLUTION
df_mean_by_gender = df_merged.groupby('gender', as_index=False).agg({
      'amount': np.mean
})
### END SOLUTION

df_mean_by_gender

  gender     amount
0      F  17.490077
1      M  11.606600
2      O  14.798731

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [24]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-09'
_points = 2

df_check = pd.DataFrame({'gender': {0: 'F', 1: 'M', 2: 'O'},
 'amount': {0: 17.490077356121578,
  1: 11.606600269252956,
  2: 14.798731049971932}})

# Check result
pd.testing.assert_frame_equal(df_mean_by_gender.sort_values(df_mean_by_gender.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 10: Create age groups

Next, you would like to find out the average transaction amount by different age groups(e.g., 10-20, 20-30, 30-40, etc). In order to perform that analysis, we'll create a new column containing the age group information.

A fully-working code is given to you since we haven't learned `pd.cut()` in class. ü¶ä `pd.cut()` converts a numerical values into a set of categorical values.

#### üëá Tasks

- ‚úîÔ∏è Copy and run the code below.

```python
df_merged['age_group'] = pd.cut(
    df_merged['age'],
    bins=[10, 20, 30, 40, 50, 999],
    labels=['10-20', '20-30', '30-40', '40-50', '50>']
)

df_merged.head(5)
```

In [25]:
### BEGIN SOLUTION
df_merged['age_group'] = pd.cut(
    df_merged['age'],
    bins=[10, 20, 30, 40, 50, 999],
    labels=['10-20', '20-30', '30-40', '40-50', '50>']
)

df_merged.head(5)
### END SOLUTION

,member_id,amount,gender,age,became_member_on,income,age_group
0,02c083884c7d45b39cc68e1314fec56c,0.83,F,20,2016-07-11,30000,10-20
1,02c083884c7d45b39cc68e1314fec56c,1.44,F,20,2016-07-11,30000,10-20
2,02c083884c7d45b39cc68e1314fec56c,4.56,F,20,2016-07-11,30000,10-20
3,02c083884c7d45b39cc68e1314fec56c,1.53,F,20,2016-07-11,30000,10-20
4,02c083884c7d45b39cc68e1314fec56c,0.50,F,20,2016-07-11,30000,10-20

#### üîë Expected Output

|  | member_id | amount | gender | age | became_member_on | income | age_group |
|---:|---:|---:|---:|---:|---:|---:|---:|
| 0 | 02c083884c7d45b39cc68e1314fec56c | 0.83 | F | 20 | 2016-07-11 | 30000 | 10-20 |
| 1 | 02c083884c7d45b39cc68e1314fec56c | 1.44 | F | 20 | 2016-07-11 | 30000 | 10-20 |
| 2 | 02c083884c7d45b39cc68e1314fec56c | 4.56 | F | 20 | 2016-07-11 | 30000 | 10-20 |
| 3 | 02c083884c7d45b39cc68e1314fec56c | 1.53 | F | 20 | 2016-07-11 | 30000 | 10-20 |
| 4 | 02c083884c7d45b39cc68e1314fec56c | 0.50 | F | 20 | 2016-07-11 | 30000 | 10-20 |

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [26]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-10'
_points = 2

df_check = df_merged.copy()
age_groups = ['50>', '40-50', '30-40', '20-30', '10-20']
age_groups.reverse()
df_check['age_group'] = pd.cut(
    df_check['AGE'.lower()],
    bins=[x * 10 for x in [1, 2, 3, 4, 5]] + [1000],
    labels=age_groups
)

# Check result
pd.testing.assert_frame_equal(df_merged.sort_values(df_merged.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 11: Average transaction amount by age group

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged`, find the average transaction amount by age group (`age_group` column).
- ‚úîÔ∏è Store the summary DataFrame to `df_mean_by_age_group`.
- ‚úîÔ∏è `df_mean_by_age_group` should contain two non-index columns.
    - `df_mean_by_age_group.columns.to_list()` should print out `['age_group', 'amount']`.
- ‚úîÔ∏è `df_merged` should remain unaltered.

#### üîë Expected Output

|    | age_group   |   amount |
|---:|:------------|---------:|
|  0 | 10-20       |  7.48039 |
|  1 | 20-30       |  8.40717 |
|  2 | 30-40       | 10.252   |
|  3 | 40-50       | 13.4737  |
|  4 | 50>         | 16.4099  |

In [27]:
### BEGIN SOLUTION
df_mean_by_age_group = df_merged.groupby('age_group', as_index=False).agg({
      'amount': np.mean
})
### END SOLUTION

df_mean_by_age_group

  age_group     amount
0     10-20   7.480393
1     20-30   8.407166
2     30-40  10.251975
3     40-50  13.473675
4       50>  16.409890

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [28]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-11'
_points = 2

df_check = pd.DataFrame({'age_group': {0: '10-20', 1: '20-30', 2: '30-40', 3: '40-50', 4: '50>'},
 'amount': {0: 7.4803926701570775,
  1: 8.407165820643007,
  2: 10.251975269699113,
  3: 13.473675454312783,
  4: 16.40988963903655}})

df_mean_by_age_group_copy = df_mean_by_age_group.copy()
df_mean_by_age_group_copy['age_group'] = df_mean_by_age_group_copy['age_group'].astype(str)

# Check result
pd.testing.assert_frame_equal(df_mean_by_age_group_copy.sort_values(df_mean_by_age_group_copy.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 12: Create income range groups

We're going to repeat the previous method on customers' income.

#### üëá Tasks

- ‚úîÔ∏è Copy and run the code below.

```python
df_merged['income_group'] = pd.cut(
    df_merged['income'],
    bins=[0, 40000, 60000, 80000, 100000, 999999],
    labels=['<40k', '40k-60k', '60k-80k', '80k-100k', '>100k']
)

df_merged.head(5)
```

In [29]:
### BEGIN SOLUTION
df_merged['income_group'] = pd.cut(
    df_merged['income'],
    bins=[0, 40000, 60000, 80000, 100000, 999999],
    labels=['<40k', '40k-60k', '60k-80k', '80k-100k', '>100k']
)

df_merged.head(5)
### END SOLUTION

,member_id,amount,gender,age,became_member_on,income,age_group,income_group
0,02c083884c7d45b39cc68e1314fec56c,0.83,F,20,2016-07-11,30000,10-20,<40k
1,02c083884c7d45b39cc68e1314fec56c,1.44,F,20,2016-07-11,30000,10-20,<40k
2,02c083884c7d45b39cc68e1314fec56c,4.56,F,20,2016-07-11,30000,10-20,<40k
3,02c083884c7d45b39cc68e1314fec56c,1.53,F,20,2016-07-11,30000,10-20,<40k
4,02c083884c7d45b39cc68e1314fec56c,0.50,F,20,2016-07-11,30000,10-20,<40k

#### üîë Expected Output

|    | member_id                        |   amount | gender   |   age | became_member_on   |   income | age_group   | income_group   |
|---:|:---------------------------------|---------:|:---------|------:|:-------------------|---------:|:------------|:---------------|
|  0 | 02c083884c7d45b39cc68e1314fec56c |     0.83 | F        |    20 | 2016-07-11         |    30000 | 10-20       | <40k           |
|  1 | 02c083884c7d45b39cc68e1314fec56c |     1.44 | F        |    20 | 2016-07-11         |    30000 | 10-20       | <40k           |
|  2 | 02c083884c7d45b39cc68e1314fec56c |     4.56 | F        |    20 | 2016-07-11         |    30000 | 10-20       | <40k           |
|  3 | 02c083884c7d45b39cc68e1314fec56c |     1.53 | F        |    20 | 2016-07-11         |    30000 | 10-20       | <40k           |
|  4 | 02c083884c7d45b39cc68e1314fec56c |     0.5  | F        |    20 | 2016-07-11         |    30000 | 10-20       | <40k           |

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [30]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-12'
_points = 2

df_check = df_merged.copy()
income_groups = ['>100k', '80k-100k', '60k-80k', '40k-60k', '<40k']
income_groups.reverse()
df_check['income_group'] = pd.cut(
    df_check['INCOME'.lower()],
    bins=[x * 10000 for x in [0, 4, 6, 8, 10]] + [999999],
    labels=income_groups
)

# Check result
pd.testing.assert_frame_equal(df_merged.sort_values(df_merged.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 13: Average transaction amount by income group

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged`, find the average transaction amount by income group (`income_group` column).
- ‚úîÔ∏è Store the summary DataFrame to `df_mean_by_income_group`.
- ‚úîÔ∏è `df_mean_by_income_group` should contain two non-index columns.
    - `df_mean_by_income_group.columns.to_list()` should print out `['income_group', 'amount']`.
- ‚úîÔ∏è `df_merged` should remain unaltered.

#### üîë Expected Output

|    | income_group   |   amount |
|---:|:---------------|---------:|
|  0 | <40k           |  6.19841 |
|  1 | 40k-60k        |  9.3538  |
|  2 | 60k-80k        | 15.1868  |
|  3 | 80k-100k       | 27.4484  |
|  4 | >100k          | 30.897   |

In [31]:
### BEGIN SOLUTION
df_mean_by_income_group = df_merged.groupby('income_group', as_index=False).agg({
      'amount': np.mean
})
### END SOLUTION

df_mean_by_income_group

  income_group     amount
0         <40k   6.198411
1      40k-60k   9.353796
2      60k-80k  15.186843
3     80k-100k  27.448400
4        >100k  30.897049

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [32]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-13'
_points = 3

df_check = pd.DataFrame({'income_group': {0: '<40k',
  1: '40k-60k',
  2: '60k-80k',
  3: '80k-100k',
  4: '>100k'},
 'amount': {0: 6.198411429621467,
  1: 9.353795970427743,
  2: 15.186842961106798,
  3: 27.44839995065385,
  4: 30.897049126815634}})

df_mean_by_income_group_copy = df_mean_by_income_group.copy()
df_mean_by_income_group_copy['income_group'] = df_mean_by_income_group_copy['income_group'].astype(str)

# Check result
pd.testing.assert_frame_equal(df_mean_by_income_group_copy.sort_values(df_mean_by_income_group_copy.columns.to_list()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Part 14: Top 5 customers by total purchase amount

This will be by far the most difficult task in this case study! ü§°

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged`, find the top 5 customers with the largest total purchase amount.
- ‚úîÔ∏è For each of the top 5 customers, list the member ID and total amount spent in a new DataFrame named `df_top5`.
- ‚úîÔ∏è `df_top5` should contain two non-index columns.
    - `df_top5.columns.to_list()` should print out `['member_id', 'amount']`.
    
#### üîë Expected Output

|       | member_id                        |   amount |
|------:|:---------------------------------|---------:|
|  3427 | 3c8d541112a74af99e88abbd0692f00e |  1608.69 |
| 13706 | f1d65ae63f174b8f80fa063adcaa63b7 |  1365.66 |
|  9985 | ae6f43089b674728a50b8727252d3305 |  1327.74 |
|  5574 | 626df8678e2a4953b9098246418c9cfa |  1321.42 |
|  6551 | 73afdeca19e349b98f09e928644610f8 |  1319.97 |

In [33]:
### BEGIN SOLUTION
df_top5 = df_merged.groupby('member_id', as_index=False).agg({
    'amount': 'sum'
}).sort_values('amount', ascending=False).head(5)
### END SOLUTION

df_top5

                              member_id   amount
3427   3c8d541112a74af99e88abbd0692f00e  1608.69
13706  f1d65ae63f174b8f80fa063adcaa63b7  1365.66
9985   ae6f43089b674728a50b8727252d3305  1327.74
5574   626df8678e2a4953b9098246418c9cfa  1321.42
6551   73afdeca19e349b98f09e928644610f8  1319.97

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix any incorrect parts.

In [34]:
# DO NOT CHANGE THE CODE IN THIS CELL
_test_case = 'part-14'
_points = 3

df_check = pd.DataFrame({'member_id': {3427: '3c8d541112a74af99e88abbd0692f00e',
  13706: 'f1d65ae63f174b8f80fa063adcaa63b7',
  9985: 'ae6f43089b674728a50b8727252d3305',
  5574: '626df8678e2a4953b9098246418c9cfa',
  6551: '73afdeca19e349b98f09e928644610f8'},
 'amount': {3427: 1608.69,
  13706: 1365.6600000000003,
  9985: 1327.7399999999998,
  5574: 1321.42,
  6551: 1319.97}})

# Check result
pd.testing.assert_frame_equal(df_top5.reset_index(drop=True),
                              df_check.reset_index(drop=True))

---

## üç∏ Congratulations!

If you've made it this far without an error, go ahead and submit your notebook.